
{
    "translation": {
      "header": {
        "about_me": "About me",
        "projects": "Projects",
        "contact": "Contact",
        "menu": "Menu",
        "links": {
          "home": "presentation",
          "about_me": "about-me",
          "projects": "projects",
          "contact": "contact"
        }
      },
      "home": {
        "welcome": "Hello! I'm Nerea Sarasola, Front-end developer and UX/UI designer.",
        "about_me": {
          "title": "About me",
          "subtitle": "I am 26 years old and until now I have worked as a graphic designer at the Bizzart social cooperative in Vicenza, a city located in the Veneto region of Italy.",
          "text": "At the cooperative, I have had the opportunity to manage and design websites using WordPress. I have also created various logos for associations and creative posters for events held in the city of Vicenza. Before working at the cooperative, I had the opportunity to work as a front-end developer and designer on various websites. <br><br> At the cooperative, I have had the opportunity to manage and design websites using WordPress. I have also created various logos for associations and creative posters for events held in the city of Vicenza. Before working at the cooperative, I had the opportunity to work as a front-end developer and designer on various websites. <br><br>  If you would like to know more about me, you can consult my <a href='https://nerea-portfolio.vercel.app/assets/CV_NereaSarasola_EN-BCmjMFId.pdf' target='_blank'><strong>curriculum vitae.</strong></a>",
          "image": {
            "alt": "Image of a woman with glasses smiling at the camera",
            "title": "Image of a smiling woman"
          }
        },
        "projects": "Projects"
      },
      "itear": {
        "card": {
          "subtitle": "Branding and UX/UI Design"
        },
        "project": {
          "title": "Itear: New identity for small and family businesses.",
          "subtitle": "The project consisted of creating a new identity, updating the corporate stationery and adding value to the company through a new website.",
          "project_overview": "Project <br className='hidden xl:block'> overview",
          "project_overview_text": "Itear is a small company located in Tolosa, (Gipuzkoa) which since the 1980s has been dedicated to the manufacture and repair of industrial machinery. Its services include centrifugal pumps, whose function is to transform mechanical energy into hydraulic energy. For the company, it is important to maintain the quality, the essence and the functioning of the parts. In addition, it is a company that collaborates with different suppliers focused on metallurgy to carry out its work.",
          "challenge": "Challenge",
          "challenge_subtitle": "The aim of the project was to generate a solid content network where an industrial entity was identified. Within the content network, the visual identity of the company and the website.",
          "challenge_text": "Within these means, the work process followed in the company, the services offered and the values that characterise the entity were studied in depth. Within the project, it was taken into account that the work was carried out within the values of sustainability and circular economy.",
          "solution": "Solution",
          "solution_subtitle": "Sinter as a typeface in its Demi version, with the purpose of showing tradition and modernisation in the industrial sector.",
          "solution_text": "Precisely thanks to the art direction of the images of the pieces and the new identity, the company's new universe was born.",
          "next_project": "Next Project",
          "images": {
            "cover": {"alt": "Image of a piece of Itear on a white background", "title": "Image of a piece of Itear"},
            "variation_one": {"alt": "Image showing the variations that an Itear logo can have", "title": "Image showing the Itear logo"},
            "variation_two": {"alt": "Imagen que muestra uno de los iconos del branding de Itear", "title": "Imagen de un icono"},
            "variation_three": {"alt": "Image of a detail of an Itear part on a white background", "title": "Image of a detail of a part"},
            "variation_four": {"alt": "Detail image of a hand welding and improving a part", "title": "Image of a hand welding"},
            "variation_five": {"alt": "Image of a part with a white background that has a blue filter", "title": "Image of a part of Itear"},
            "variation_six": {"alt": "Image of a piece of Itear with white background", "title": "Image of a piece of Itear"},
            "variation_seven": {"alt": "Image showing the corporate stationery of the company Itear", "title": "Image of the corporate stationery of Itear"},
            "variation_eight": {"alt": "Image showing the business card of Itear's corporate stationery", "title": "Image of Itear's corporate stationery"},
            "variation_nine": {"alt": "Image showing the corporate folder of Itear's corporate stationery", "title": "Image of Itear's corporate stationery"},
            "variation_ten": {"alt": "Image presenting the design of Itear's new corporate website", "title": "Image presenting Itear's website"},
            "next_project": {"alt": "Image referring to Kimu's project", "title": "Kimu Image"}
          }
        }
      },
      "kimu": {
        "card": {
          "subtitle": "Branding, Packaging and UX/UI Design"
        },
        "project": {
          "title": "Kimu: New identity and packaging.",
          "subtitle": "The project consisted of creating a new corporate identity, creating a new packaging design and promoting and guaranteeing the company's values through a website.",
          "project_overview": "Project <br className='hiddem xl:block'> overview",
          "project_overview_text": "Germinados Kimuak, located in a small village in Bizkaia, is the only local company specialised in growing and marketing sprouts in the Basque Country and sells its products in small shops. Kimu differentiates itself from other entities by the wide variety of products it offers to local people. Not only does it sell fresh, ready-to-eat sprouts, but it also sells seeds so that people can produce the sprouts in their own homes.",
          "challenge": "Challenge",
          "challenge_subtitle": "The aim of the project was to create a new brand and generate packaging in line with the principles of sustainability and reuse.",
          "challenge_text": "In this way, the terms that define the brand are on the one hand that it is a transparent entity, it is enriching and that it is approachable and finally, it is a brand that focuses on the concept of DIY.",
          "solution": "Solution",
          "solution_subtitle": "Mark based on a single variation. It follows a simple structure, which is created through the distance between the letters of the mark itself.",
          "solution_text": "To create the identity and the packaging, a design in relation and coherence with the three elements was proposed, which were the typography, always using Franklin Gothic, in different sizes or hierarchies, on the other hand, the colours and the illustration, which was done taking as a reference the orchards of the farmhouses.",
          "next_project": "Next Project",
          "images": {
            "cover": {"alt": "Image of an elderly person talking to a couple at the market in Tolosa", "title": "Image of the Tolosa market"},
            "variation_one": {"alt": "Image showing white Kimu logo on orange background", "title": "Image showing the Kimu logo"},
            "variation_two": {"alt": "Image showing the black Kimu isotype on a white background", "title": "Image showing the Kimu isotype"},
            "variation_three": {"alt": "Image showing a detail of a hand holding vegetables.", "title": "Image of a hand"},
            "variation_four": {"alt": "Image of an illustration of a leek with a white outline on an orange background", "title": "Image of a leek illustration"},
            "variation_five": {"alt": "Image of an illustration of black organic lines on a white background", "title": "Image of an illustration of organic lines"},
            "variation_six": {"alt": "Image of a hand holding a Kimu corporate tote bag", "title": "Image of a tote bag"},
            "variation_seven": {"alt": "Image showing the front of the packaging of the jar used to sell chickpea sprouts", "title": "Image of the sprout jar"},
            "variation_eight": {"alt": "Image showing the back of the packaging of the jar used to sell chickpea sprouts", "title": "Image of the sprout jar"},
            "variation_nine": {"alt": "Image showing the front of the packaging of the jar used to package the bean sprouts", "title": "Image of the bean sprout jar"},
            "variation_ten": {"alt": "Image showing the layout of several desktop-sized pages on a corporate orange background.", "title": "Image presenting different pages of Kimu's web site"},
            "variation_eleven": {"alt": "Image showing the layout of several mobile-sized pages on a corporate orange background", "title": "Image presenting different pages of Kimu's web site"},
            "next_project": {"alt": "Image referring to the Descubre project", "title": "Image from Descubre"}
          }
        }
      },
      "descubre": {
        "card": {
          "subtitle": "Editorial design"
        },
        "project": {
          "title": "Descubre: Creation of a magazine.",
          "subtitle": "The project consisted of creating a new layout for a magazine.",
          "project_overview": "Project <br className='hiddem xl:block'> Overview",
          "project_overview_text": "Descubre is a monthly publication dedicated to exploring the rich tapestry of cultures around the world. Each issue of Descubre focuses on a different country, offering readers an in-depth look at its history, traditions, current events, and unique customs. From uncovering ancient civilizations to shedding light on modern-day developments, Descubre aims to educate and inspire curiosity about the diverse ways of life that shape our global community. With beautifully curated articles, stunning photography, and engaging stories, it serves as a window into the heart and soul of each nation, fostering understanding and appreciation of cultures from every corner of the world.",
          "challenge": "Challenge",
          "challenge_subtitle": "The goal of the Descubre project was to design and create a magazine that not only informs but captivates readers through a blend of thoughtful content and aesthetically appealing design.",
          "challenge_text": "For the layout of the texts, illustrations and images, a grid was designed according to the needs of the project so that all the information would fit together well.",
          "solution": "Solution",
          "solution_subtitle": "The design process started with the grid as a guide, and from there the pages were created until a satisfactory result was achieved.",
          "solution_text": "Each issue of Descubre integrates interactive and visually stimulating elements like custom illustrations, and high-quality photography, which work together to enhance the reading experience. By consistently adhering to a cohesive editorial and design structure, the project resulted in a magazine that not only serves as a source of knowledge but also as a piece of art that reflects the beauty and diversity of global cultures.",
          "view_project": "To see the final result, access to see the interactive magazine",
          "view_project_here": "here",
          "next_project": "Next Project",
          "images": {
            "cover": {"alt": "Image showing the cover of the magazine called Descubre", "title": "Image of the cover of the magazine"},
            "variation_one": {"alt": "Image showing one of the pages of the magazine laid out on a grey background", "title": "Image of one of the pages of the magazine"},
            "variation_two": {"alt": "Image of a collage used on one of the pages of the magazine", "title": "Image of a collage"},
            "variation_three": {"alt": "Image presenting several pages of the same magazine in a diagonal perspective", "title": "Image presenting the magazine"},
            "variation_four": {"alt": "Image showing the cover of one of the sections of the Descubre magazine", "title": "Image of a cover of the sections"},
            "next_project": {"alt": "Image referring to the Errofest project", "title": "Image of Errofest"}
          }
        }
      },
      "errofest": {
        "card": {
          "subtitle": "Branding, UX/UI Design and Developing"
        },
        "project": {
          "title": "Errofest: Creation of an identity and promotion of a local festival.",
          "subtitle": "The project consisted of creating the identity and landing page to promote the festival in the best possible way.",
          "project_overview": "Project <br className='hiddem xl:block'> Overview",
          "project_overview_text": "Errofest is a cultural festival that includes different activities, such as local gastronomy, music and painting. It has been held in Itsasondo, a village in Gipuzkoa, since 2019 and every year it generates more and more interest among the locals and people from other villages in the region. In 2025, the event will celebrate its fifth anniversary, so the organisers decided to improve its identity and landing page.",
          "challenge": "Challenge",
          "challenge_subtitle": "The project had two objectives: to create a new identity that reflected the local spirit of the festival and to design a simple landing page that briefly explained the aspects to be taken into account when attending the festival.",
          "challenge_text": "The environment, the colours of the landscape and the local culture were the aspects that were taken into account when creating the new identity of the festival. In addition, an attempt was made to reflect the fusion between tradition and new cultural trends.",
          "solution": "Solution",
          "solution_subtitle": "The logo was handcrafted to show the curved, organic lines of nature itself.",
          "solution_text": "Thanks to the colours reminiscent of nature, the images collected from other years when the festival was held and the exercise carried out on the needs of the new landing page, a new page was created.",
          "view_project": "To see the final result, access the website",
          "view_project_here": "here",
          "project_web": "https://errofest.vercel.app/en",
          "next_project": "Next Project",
          "images": {
            "cover": {"alt": "Image showing a brass band playing in a natural setting", "title": "Image of a brass band"},
            "variation_one": {"alt": "Image of a landscape with a mountain in the background", "title": "Image with a mountain"},
            "variation_two": {"alt": "Image showing different illustrations that relate to the event", "title": "Image with illustrations"},
            "variation_three": {"alt": "Image of a smiling woman who is at a concert", "title": "Image of a smiling woman"},
            "variation_four": {"alt": "Image of one of last year's concerts", "title": "Image of one of the concerts"},
            "variation_five": {"alt": "Image on green background showing the design of the website in different formats", "title": "Image on green background"},
            "next_project": {"alt": "Image referring to the Design System project", "title": "Image of the Design System"}
          }
        }
      },
      "design_system": {
        "card": {
          "subtitle": "UX/UI Design"
        },
        "project": {
          "title": "Creation of a design system adapted to a music application.",
          "subtitle": "The project consisted of designing the system to be used in the new music platform called Echo.",
          "project_overview": "Project <br className='hiddem xl:block'> Overview",
          "project_overview_text": "The Echo app aims to provide an intuitive and convenient user experience for easy listening to music. Therefore, the starting point was arrived at after listing the functionalities that the app would have, which allowed the principles, functions and components to be better developed.",
          "challenge": "Challenge",
          "challenge_subtitle": "After thinking about the complete list of elements that would complement the design system, development began on the main elements.",
          "challenge_text": "The first elements to be developed were typefaces, colours, graphic elements, iconography and structure.",
          "typefaces": "Typefaces",
          "typefaces_text": "The IBM Plex Mono typeface is used for headings and the Inter typeface for texts. The scales of the typefaces have been defined for use on different device sizes,which change and follow the order established according to the size of the devices.",
          "colours": "Colours",
          "colours_text": "The colour palette has been established with a total of five secondary colours, which together with the main colours (black and white) help to combine colours to generate different compositions. On the other hand, there are the semantic colours, which have been chosen to inform the user. Different types of colour transparency will also be used to create new compositions.",
          "iconography": "Iconography",
          "iconography_text": "Icon sizes have been set following the same logic as column sizes and page layouts.",
          "solution": "Solution",
          "solution_subtitle": "After fine-tuning the principles of the design system, it was time to create the components.",
          "solution_text": "The library components were created with the idea that they would be used on different device and screen sizes. In addition, a clear and simple design was used to create them, in order to make the execution of the design and layout of the screens more effective.",
          "next_steps": "Next Steps",
          "next_steps_text": "After all the work process, the next step was to think about the screens that the Echo app would have. If you want to know more about this, you can check it out through <a href=https://www.figma.com/design/DviDdC0Vn7GTRyGWuMsVjX/Echo?node-id=0-1&p=f&t=7dHt3xV2X6vmvCCC-0' target='_blank' class='relative after:absolute after:bottom-[10px] after:left-0 after:h-[5px] after:w-full after:origin-bottom-left after:scale-x-100 after:bg-yellow after:transition-transform after:duration-150 after:ease-in-out hover:after:origin-bottom-right hover:after:scale-x-0'>this project </a>.",
          "next_steps_here": "here",
          "next_project": "Next Project",
          "images": {
            "cover": {"alt": "Image showing the variations of the buttons and lists that have been designed for the Design System", "title": "Image of the Design System buttons and lists"},
            "variation_one": {"alt": "Image showing colours and different components that are part of the Design System", "title": "Image of the components of the Design System"},
            "variation_two": {"alt": "Image showing the two typefaces used within the Design System", "title": "Typefaces of the Design System"},
            "variation_three": {"alt": "Image showing the chromatic range of colours used for the Design System", "title": "Design System Colours"},
            "variation_four": {"alt": "Image showing a CD icon that has been designed to be part of the Design System", "title": "Design System Icon"},
            "variation_five": {"alt": "Image showing the icons that are part of the Design System", "title": "Design System icons"},
            "variation_six": {"alt": "Image showing different types of components that are part of the Design System", "title": "Design System components image"},
            "next_project": {"alt": "Image referring to Echo's project", "title": "Echo's image"}
          }
        }
      },
      "echo": {
        "card": {
          "subtitle": "UX/UI Design"
        },
        "project": {
          "title": "Echo: an application for listening to streaming music.",
          "subtitle": "The project focused on the user experience (UX) and user interface (UI) design of the application.",
          "project_overview": "Project <br className='hiddem xl:block'> Overview",
          "project_overview_text": "Echo is a music streaming platform that aims to offer a simple and effective user experience, and to this end it has an intuitive and easy-to-use interface. From the beginning, the app was designed to be intuitive from the very first use. In addition, the music suggested had to match the user's tastes and the interface had to convey a sense of enjoyment and comfort.",
          "challenge": "Challenge",
          "challenge_subtitle": "Once the objectives had been defined and the system had been designed and documented, the design of the pages was planned and wireframes were drawn up for all the pages of the application.",
          "challenge_text": "For the layout of the wireframes, a 16 px grid was followed, which helped to create and link all the components that had been designed beforehand.",
          "solution": "Solution",
          "solution_subtitle": "After creating all the templates, it was time to add the images and colours to finalise the prototyping of the platform.",
          "solution_text": "In addition, much emphasis was placed on the feature that sets this app apart from other music streaming platforms: instead of simply offering predefined playlists, it will adapt to the musical tastes of each user by means of practical questions. In this way, personalised playlists tailored to the musical interests of each user will be created.",
          "next_project": "Next Project",
          "images": {
            "cover": {"alt": "Image showing the main screen of the music app called Echo", "title": "Echo app image"},
            "variation_one": {"alt": "Image showing the Artist detail screen of the Echo music app", "title": "Echo artist detail screen image"},
            "variation_two": {"alt": "Image showing the Echo music app's Genres screen", "title": "Echo genres detail screen image"},
            "variation_three": {"alt": "Image showing all the wireframes that have been made to visualise all the screens that the app is going to have.", "title": "Image of the Echo wireframes"},
            "variation_four": {"alt": "Image showing some of the screens that have been designed and that are part of the music application called Echo", "title": "Image of the Echo screens"},
            "next_project": {"alt": "Image referring to the Itear project", "title": "Image of Itear"}
          }
        }
      },
      "error_page": {
        "subtitle": "Page Not Found",
        "button_text": "Go back home",
        "button_url": "/en"
      },
      "footer": {
        "title": "Feel free to contact me!",
        "social_networks": "Social media",
        "cv": "/src/assets/CV_NereaSarasola_EN.pdf"
      }
    }
}