
{
    "translation": {
      "header": {
        "about_me": "Sobre mí",
        "projects": "Proyectos",
        "contact": "Contacto",
        "menu": "Menu",
        "links": {
          "home": "presentacion",
          "about_me": "sobre-mi",
          "projects": "proyectos",
          "contact": "contacto"
        }
      },
      "home": {
        "welcome": "¡Hola! Soy Nerea Sarasola, Desarrolladora Front-end y Diseñadora UX/UI.",
        "about_me": {
          "title": "Sobre mí",
          "subtitle": "Tengo 26 años y hasta ahora he trabajado como diseñadora gráfica en la cooperativa social Bizzart de Vicenza, una ciudad ubicada en la región del Véneto, en Italia.",
          "text": "En la cooperativa he tenido la oportunidad de gestionar y maquetar páginas web con WordPress. También he creado diferentes logotipos para asociaciones y carteles creativos para eventos que se iban a celebrar en la ciudad de Vicenza. Antes de trabajar en la cooperativa, tuve la oportunidad de trabajar como desarrolladora front-end y maquetadora en diferentes páginas web. <br><br> Mi objetivo principal de cara al futuro es formar parte de un nuevo equipo en el que pueda aprender y adquirir más conocimientos sobre UX/UI, maquetación y desarrollo front-end. <br><br> Si quieres saber más sobre mí, puedes consultar mi <a href='https://nerea-portfolio.vercel.app/assets/CV_NereaSarasola_ES--SR-bZZv.pdf' target='_blank' class='relative inline-block h-[35px]'><strong class='after:absolute after:bottom-0 after:left-0 after:h-[5px] after:w-full after:origin-bottom-left after:scale-x-100 after:bg-yellow after:transition-transform after:duration-150 after:ease-in-out hover:after:origin-bottom-right hover:after:scale-x-0''>currículum vitae.</strong></a>",
          "image": {
            "alt": "Imagen de una mujer con gafas sonriendo a la cámara",
            "title": "Imagen de una mujer sonriente"
          }
        },
        "projects": "Proyectos"
      },
      "itear": {
        "card": {
          "subtitle": "Branding y Diseño UX/UI"
        },
        "project": {
          "title": "Itear: Nueva identidad para pequeñas empresas y empresas familiares.",
          "subtitle": "El proyecto consistió en crear una nueva identidad, actualizar la papelería corporativa y añadir valor a la empresa a través de un nuevo sitio web.",
          "project_overview": "Visión general <br className='hidden xl:block'> del proyecto",
          "project_overview_text": "Itear es una pequeña empresa ubicada en Tolosa, (Gipuzkoa) que desde los años 80 se dedica a la fabricación y reparación de maquinaria industrial. Entre sus servicios destacan las bombas centrífugas, cuya función es transformar la energía mecánica en energía hidráulica. Para la empresa, es importante mantener la calidad, la esencia y el funcionamiento de las piezas. Además, es una empresa que colabora con diferentes proveedores centrados en la metalurgia para llevar a cabo su trabajo.",
          "challenge": "Desafío",
          "challenge_subtitle": "El objetivo del proyecto era generar una sólida red de contenidos en la que se identificara una entidad industrial. Dentro de la red de contenidos, la identidad visual de la empresa y el sitio web.",
          "challenge_text": "Dentro de estos medios, se profundizó en el proceso de trabajo seguido en la empresa, los servicios ofrecidos y los valores que caracterizan a la entidad. Dentro del proyecto, se tuvo en cuenta que el trabajo se realizara dentro de los valores de sostenibilidad y economía circular.",
          "solution": "Solución",
          "solution_subtitle": "Sinter como tipo de letra en su versión Demi, con el fin de mostrar la tradición y la modernización en el sector industrial.",
          "solution_text": "Precisamente gracias a la dirección artística de las imágenes de las piezas y a la nueva identidad, nació el nuevo universo de la empresa.",
          "next_project": "Próximo Proyecto",
          "images": {
            "cover": {"alt": "Imagen de una pieza de Itear en un fondo blanco", "title": "Imagen de una pieza de Itear"},
            "variation_one": {"alt": "Imagen que muestra las variaciones que puede tener un logo de Itear", "title": "Imagen que muestra el logo de Itear"},
            "variation_two": {"alt": "Imagen que muestra uno de los iconos del branding de Itear", "title": "Imagen de un icono"},
            "variation_three": {"alt": "Imagen de un detalle de una pieza de Itear en un fondo blanco", "title": "Imagen del detalle de una pieza"},
            "variation_four": {"alt": "Imagen del detalle de una mano soldando y mejorando una pieza", "title": "Imagen de una mano soldando"},
            "variation_five": {"alt": "Imagen de una pieza con fondo blanco que tiene un filtro azul", "title": "Imagen de una pieza de Itear"},
            "variation_six": {"alt": "Imagen de una pieza de Itear con fondo blanco", "title": "Imagen de una pieza de Itear"},
            "variation_seven": {"alt": "Imagen que muestra la papelería corporativa de la empresa Itear", "title": "Imagen de la papelería corporativa de Itear"},
            "variation_eight": {"alt": "Imagen que muestra la tarjeta de visita de la papelería corporativa de la empresa de Itear", "title": "Imagen de la papelería corporativa de Itear"},
            "variation_nine": {"alt": "Imagen que muestra la carpeta corporativa de la papelería corporativa de la empresa de Itear", "title": "Imagen de la papelería corporativa de Itear"},
            "variation_ten": {"alt": "Imagen que presenta el diseño de la nueva web corporativa de Itear", "title": "Imagen presentando la web de Itear"},
            "next_project": {"alt": "Imagen que hace referencia al proyecto de Kimu", "title": "Imagen de Kimu"}
          }
        }
      },
      "kimu": {
        "card": {
          "subtitle": "Branding, Packaging y Diseño UX/UI"
        },
        "project": {
          "title": "Kimu: Nueva identidad y packaging.",
          "subtitle": "El proyecto consistió en crear una nueva identidad corporativa, realizar un nuevo diseño de envase y promocionar y garantizar los valores de la empresa a través de un sitio web.",
          "project_overview": "Visión general <br className='hiddem xl:block'> del proyecto",
          "project_overview_text": "Germinados Kimuak, situada en un pequeño pueblo de Bizkaia, es la única empresa local especializada en el cultivo y comercialización de germinados en el País Vasco y vende sus productos en pequeñas tiendas. Kimu se diferencia de otras entidades por la gran variedad de productos que ofrece a la población local. No sólo vende germinados frescos y listos para consumir, sino que también vende semillas para que la gente pueda producir los germinados en sus propias casas.",
          "challenge": "Desafío",
          "challenge_subtitle": "El objetivo del proyecto era crear una nueva marca y generar envases acordes con los principios de sostenibilidad y reutilización.",
          "challenge_text": "De este modo, los términos que definen la marca son, por un lado, que es una entidad transparente, que es enriquecedora y que es accesible y, por último, que es una marca que se centra en el concepto de DIY.",
          "solution": "Solución",
          "solution_subtitle": "Marca basada en una única variación. Sigue una estructura sencilla, que se crea a través de la distancia entre las letras de la propia marca.",
          "solution_text": "Para crear la identidad y el envase, se propuso un diseño en relación y coherencia con los tres elementos, que eran la tipografía, utilizando siempre Franklin Gothic, en diferentes tamaños o jerarquías, por otro lado, los colores y la ilustración, que se realizó tomando como referencia los huertos de los caseríos.",
          "next_project": "Próximo Proyecto",
          "images": {
            "cover": {"alt": "Imagen de una persona mayor hablando con una pareja en el mercado de Tolosa", "title": "Imagen del mercado de Tolosa"},
            "variation_one": {"alt": "Imagen que muestra el logotipo de Kimu blanco en fondo naranja", "title": "Imagen que muestra el logotipo de Kimu"},
            "variation_two": {"alt": "Imagen que muestra el isotipo de Kimu negro en fondo blanco", "title": "Imagen que muestra el isotipo de Kimu"},
            "variation_three": {"alt": "Imagen que muestra un detalle de una mano sosteniendo unas verduras", "title": "Imagen de una mano"},
            "variation_four": {"alt": "Imagen de una ilustración de un puerro con un trazado blanco en fondo naranja", "title": "Imagen de una ilustración de un puerro"},
            "variation_five": {"alt": "Imagen de una ilustración de líneas orgánicas negras en fondo blanco", "title": "Imagen de una ilustración de líneas orgánicas"},
            "variation_six": {"alt": "Imagen de una mano sosteniendo una tote bag corporativo de Kimu", "title": "Imagen de una tote bag"},
            "variation_seven": {"alt": "Imagen que muestra la parte delantera del packaging del frasco que se utiliza para vender los germinados de garbanzos", "title": "Imagen del frasco de los germinados"},
            "variation_eight": {"alt": "Imagen que muestra la parte trasera del packaging del frasco que se utiliza para vender los germinados de garbanzos", "title": "Imagen del frasco de los germinados"},
            "variation_nine": {"alt": "Imagen que muestra la parte delantera del packaging del frasco que se utiliza para envasar las semillas de los germinados de alubias", "title": "Imagen del frasco de los germinados de alubias"},
            "variation_ten": {"alt": "Imagen que muestra el diseño de varias páginas del tamaño desktop en un fondo naranja corporativo", "title": "Imagen que presenta diferentes páginas de la web de Kimu"},
            "variation_eleven": {"alt": "Imagen que muestra el diseño de varias páginas del tamaño mobile en un fondo naranja corporativo", "title": "Imagen que presenta diferentes páginas de la web de Kimu"},
            "next_project": {"alt": "Imagen que hace referencia al proyecto de Descubre", "title": "Imagen de Descubre"}
          }
        }
      },
      "descubre": {
        "card": {
          "subtitle": "Diseño editorial"
        },
        "project": {
          "title": "Descubre: Creación de una revista.",
          "subtitle": "El proyecto consistía en crear un nuevo diseño para una revista.",
          "project_overview": "Visión general <br className='hiddem xl:block'> del proyecto",
          "project_overview_text": "Descubre es una publicación mensual dedicada a explorar el rico tapiz de culturas de todo el mundo. Cada número de Descubre se centra en un país diferente, ofreciendo a los lectores una visión en profundidad de su historia, tradiciones, actualidad y costumbres únicas. Desde descubrir antiguas civilizaciones hasta arrojar luz sobre los acontecimientos modernos, Descubre pretende educar e inspirar curiosidad sobre las diversas formas de vida que conforman nuestra comunidad global. Con artículos de gran calidad, fotografías impresionantes y relatos atractivos, sirve de ventana al corazón y al alma de cada nación, fomentando la comprensión y el aprecio de las culturas de todos los rincones del mundo.",
          "challenge": "Desafío",
          "challenge_subtitle": "El objetivo del proyecto Descubre era diseñar y crear una revista que no sólo informara, sino que también cautivara a los lectores a través de una mezcla de contenido reflexivo y diseño estéticamente atractivo.",
          "challenge_text": "Para la maquetación de los textos, ilustraciones e imágenes, se diseñó una cuadrícula acorde con las necesidades del proyecto, de modo que toda la información encajara bien.",
          "solution": "Solución",
          "solution_subtitle": "El proceso de diseño comenzó con la cuadrícula como guía, y a partir de ahí se fueron creando las páginas hasta lograr un resultado satisfactorio.",
          "solution_text": "Cada número de Descubre integra elementos interactivos y visualmente estimulantes, como ilustraciones personalizadas y fotografías de alta calidad, que contribuyen a mejorar la experiencia de lectura. Gracias a la coherencia de la estructura editorial y de diseño, el proyecto dio como resultado una revista que no solo sirve como fuente de conocimiento, sino también como obra de arte que refleja la belleza y la diversidad de las culturas del mundo.",
          "view_project": "Para ver el resultado final, acceda a ver la revista interactiva",
          "view_project_here": "aquí",
          "next_project": "Siguiente Proyecto",
          "images": {
            "cover": {"alt": "Imagen que muestra la portada de la revista llamada Descubre", "title": "Imagen de la portada de la revista"},
            "variation_one": {"alt": "Imagen que muestra una de las páginas de la revista maquetada en fondo gris", "title": "Imagen de una de las páginas de la revista"},
            "variation_two": {"alt": "Imagen de un collage que se utiliza en una de las páginas de la revista", "title": "Imagen de un collage"},
            "variation_three": {"alt": "Imagen que presenta varias páginas de la misma revista en una perspectiva diagonal", "title": "Imagen que presenta la revista"},
            "variation_four": {"alt": "Imagen que muestra la portada de unas de las secciones de la revista de Descubre", "title": "Imagen de una portada de las secciones"},
            "next_project": {"alt": "Imagen que hace referencia al proyecto de Errofest", "title": "Imagen de Errofest"}
          }
        }
      },
      "errofest": {
        "card": {
          "subtitle": "Branding, Diseño UX/UI y Desarrollo"
        },
        "project": {
          "title": "Errofest: Creación de una identidad y promoción de un festival local.",
          "subtitle": "El proyecto consistió en crear la identidad y la página de aterrizaje para promocionar el festival de la mejor manera posible.",
          "project_overview": "Visión general <br className='hiddem xl:block'> del proyecto",
          "project_overview_text": "Errofest es un festival cultural que incluye diferentes actividades, como gastronomía local, música y pintura. Se celebra en Itsasondo, un pueblo de Gipuzkoa, desde 2019 y cada año genera más interés entre los lugareños y gente de otros pueblos de la región. <br><br> En 2025, el evento celebrará su quinto aniversario, por lo que los organizadores decidieron mejorar su identidad y su página de aterrizaje.",
          "challenge": "Desafío",
          "challenge_subtitle": "El proyecto tenía dos objetivos: crear una nueva identidad que reflejara el espíritu local del festival y diseñar una sencilla página de aterrizaje que explicara brevemente los aspectos a tener en cuenta a la hora de asistir al festival.",
          "challenge_text": "El entorno, los colores del paisaje y la cultura local fueron los aspectos que se tuvieron en cuenta a la hora de crear la nueva identidad del festival. Además, se intentó reflejar la fusión entre tradición y nuevas tendencias culturales.",
          "solution": "Solución",
          "solution_subtitle": "El logotipo se hizo a mano para mostrar las líneas curvas y orgánicas de la propia naturaleza.",
          "solution_text": "Gracias a los colores que recuerdan a la naturaleza, las imágenes recopiladas de otros años en los que se celebró el festival y el ejercicio realizado sobre las necesidades de la nueva página de aterrizaje, se creó una nueva página.",
          "view_project": "Para ver el resultado final, acceda al sitio web",
          "view_project_here": "aquí",
          "project_web": "https://errofest.vercel.app/es",
          "next_project": "Siguiente Proyecto",
          "images": {
            "cover": {"alt": "Imagen que muestra una banda de música tocando en un entorno natural", "title": "Imagen de una banda de música"},
            "variation_one": {"alt": "Imagen de un paisaje con una montaña al fondo", "title": "Imagen con una montaña"},
            "variation_two": {"alt": "Imagen que muestra diferentes ilustraciones que tienen relación con el evento", "title": "Imagen con ilustraciones"},
            "variation_three": {"alt": "Imagen de una mujer sonriendo que está en un concierto", "title": "Imagen de una mujer sonriendo"},
            "variation_four": {"alt": "Imagen de uno de los conciertos del año pasado", "title": "Imagen de uno de los conciertos"},
            "variation_five": {"alt": "Imagen en fondo verde que muestra el diseño de la página web en diferentes formatos", "title": "Imagen en fondo verde"},
            "next_project": {"alt": "Imagen que hace referencia al proyecto del Design System", "title": "Imagen del Design System"}
          }
        }
      },
      "design_system": {
        "card": {
          "subtitle": "Diseño UX/UI"
        },
        "project": {
          "title": "Creación de un sistema de diseño adaptado a una aplicación musical.",
          "subtitle": "El proyecto consistía en diseñar el sistema que se utilizaría en la nueva plataforma musical llamada Echo.",
          "project_overview": "Visión general <br className='hiddem xl:block'> del proyecto",
          "project_overview_text": "La aplicación Echo pretende ofrecer una experiencia de usuario intuitiva y cómoda para escuchar música fácilmente. Por tanto, se llegó al punto de partida tras enumerar las funcionalidades que tendría la app, lo que permitió desarrollar mejor los principios, funciones y componentes.",
          "challenge": "Desafío",
          "challenge_subtitle": "Tras reflexionar sobre la lista completa de elementos que complementarían el sistema de diseño, comenzó el desarrollo de los elementos principales.",
          "challenge_text": "Los primeros elementos que se desarrollaron fueron los tipos de letra, los colores, los elementos gráficos, la iconografía y la estructura.",
          "typefaces": "Tipografías",
          "typefaces_text": "El tipo de letra IBM Plex Mono se utiliza para los títulos y el tipo Inter para los textos. Las escalas de los tipos de letra se han definido para su uso en distintos tamaños de dispositivo,que cambian y siguen el orden establecido según el tamaño de los dispositivos.",
          "colours": "Colores",
          "colours_text": "La paleta de colores se ha establecido con un total de cinco colores secundarios, que junto con los principales (blanco y negro) ayudan a combinar colores para generar distintas composiciones. Por otro lado, están los colores semánticos, que se han elegido para informar al usuario. También se utilizarán distintos tipos de transparencia cromática para crear nuevas composiciones.",
          "iconography": "Iconografía",
          "iconography_text": "Los tamaños de los iconos se han establecido siguiendo la misma lógica que los tamaños de las columnas y los diseños de página.",
          "solution": "Solución",
          "solution_subtitle": "Tras afinar los principios del sistema de diseño, llegó el momento de crear los componentes.",
          "solution_text": "Los componentes de la biblioteca se crearon con la idea de que se utilizarían en distintos dispositivos y tamaños de pantalla. Además, para crearlos se utilizó un diseño claro y sencillo, con el fin de que la ejecución del diseño y la disposición de las pantallas fueran más eficaces.",
          "next_steps": "Siguientes pasos",
          "next_steps_text": "Después de todo el proceso de trabajo, el siguiente paso fue pensar en las pantallas que tendría la aplicación Echo. Si quieres saber más sobre esto, puedes consultarlo a través de este <a href=https://www.figma.com/design/DviDdC0Vn7GTRyGWuMsVjX/Echo?node-id=0-1&p=f&t=7dHt3xV2X6vmvCCC-0' target='_blank' class='relative inline-block h-[40px]'><span class='after:absolute after:bottom-0 after:left-0 after:h-[5px] after:w-full after:origin-bottom-left after:scale-x-100 after:bg-yellow after:transition-transform after:duration-150 after:ease-in-out hover:after:origin-bottom-right hover:after:scale-x-0''>enlace</span> </a> del proyecto.",
          "next_project": "Siguiente Proyecto",
          "images": {
            "cover": {"alt": "Imagen que muestra las variaciones de los botones y las listas que se han diseñado para el Sistema de Diseño", "title": "Imagen de los botones y las listas del Sistema de Diseño"},
            "variation_one": {"alt": "Imagen que muestra colores y diferentes componentes que forman parte del Sistema de Diseño", "title": "Imagen de los componentes del Sistema de Diseño"},
            "variation_two": {"alt": "Imagen que muestra las dos tipografías que se utilizan dentro del Sistema de Diseño", "title": "Tipografías del Sistema de Diseño"},
            "variation_three": {"alt": "Imagen que muestra la gama cromáica de colores que se usa para el Sistema de Diseño", "title": "Colores del Sistema de Diseño"},
            "variation_four": {"alt": "Imagen que muestra un icono de un CD que se ha diseñado para formar parte del Sistema de Diseño", "title": "Icono del Sistema de Diseño"},
            "variation_five": {"alt": "Imagen que muestra los iconos que forman parte del Sistema de Diseño", "title": "Iconos del Sistema de Diseño"},
            "variation_six": {"alt": "Imagen que muestra diferentes tipos componentes que forman parte del Sistema de Diseño", "title": "Imagen de los componentes del Sistema de Diseño"},
            "next_project": {"alt": "Imagen que hace referencia al proyecto de Echo", "title": "Imagen de Echo"}
          }
        }
      },
      "echo": {
        "card": {
          "subtitle": "Diseño UX/UI"
        },
        "project": {
          "title": "Echo: una aplicación para escuchar música en streaming.",
          "subtitle": "El proyecto se centró en la experiencia de usuario (UX) y el diseño de la interfaz de usuario (UI) de la aplicación.",
          "project_overview": "Visión general <br className='hiddem xl:block'> del proyecto",
          "project_overview_text": "Echo es una plataforma de streaming de música que pretende ofrecer una experiencia de usuario sencilla y eficaz, y para ello cuenta con una interfaz intuitiva y fácil de usar. Desde el principio, la aplicación se diseñó para que fuera intuitiva desde el primer uso. Además, la música sugerida tenía que coincidir con los gustos del usuario y la interfaz debía transmitir una sensación de disfrute y comodidad.",
          "challenge": "Desafío",
          "challenge_subtitle": "Una vez definidos los objetivos y diseñado y documentado el sistema, se planificó el diseño de las páginas y se elaboraron wireframes para todas las páginas de la aplicación.",
          "challenge_text": "Para la maquetación de los wireframes se siguió una cuadrícula de 16 px, que ayudó a crear y enlazar todos los componentes que se habían diseñado de antemano.",
          "solution": "Solución",
          "solution_subtitle": "Tras crear todas las plantillas, llegó el momento de añadir las imágenes y los colores para finalizar el prototipado de la plataforma.",
          "solution_text": "Además, se hizo mucho hincapié en la característica que diferencia a esta app de otras plataformas de streaming musical: en lugar de ofrecer simplemente listas de reproducción predefinidas, se adaptará a los gustos musicales de cada usuario mediante preguntas prácticas. De este modo, se crearán listas de reproducción personalizadas y adaptadas a los intereses musicales de cada usuario.",
          "next_project": "Siguiente Proyecto",
          "images": {
            "cover": {"alt": "Imagen que muestra la pantalla principal de la aplicación de música llamada Echo", "title": "Imagen de la aplicación Echo"},
            "variation_one": {"alt": "Imagen que muestra la pantalla del detalle del Artista de la aplicación de música de Echo", "title": "Imagen de la pantalla del artista de Echo"},
            "variation_two": {"alt": "Imagen que muestra la pantalla de los Géneros de la aplicación de música de Echo", "title": "Imagen de la pantalla de los géneros de Echo"},
            "variation_three": {"alt": "Imagen que muestra todos los wireframes que se han realizado para visualizar todas las pantallas que va a tener la aplicación", "title": "Imagen de los wireframes de Echo"},
            "variation_four": {"alt": "Imagen que muestra algunas de las pantallas que se han diseñado y que forman parte de la aplicación de música llamada Echo", "title": "Imagen de las pantallas de Echo"},
            "next_project": {"alt": "Imagen que hace referencia al proyecto de Itear", "title": "Imagen de Itear"}
          }
        }
      },
      "error_page": {
        "subtitle": "No se ha encontrado la página",
        "button_text": "Vuelve al inicio",
        "button_url": "/es"
      },
      "footer": {
        "title": "¡No dudes en ponerte en contacto conmigo!",
        "social_networks": "Redes sociales",
        "cv": "/src/assets/CV_NereaSarasola_ES.pdf"
      }
    }
}