
{
    "translation": {
      "header": {
        "about_me": "Niri buruz",
        "projects": "Proiektuak",
        "contact": "Kontaktua",
        "menu": "Menua"
      },
      "home": {
        "welcome": "Kaixo! Nerea Sarasola naiz, Front-end garatzailea eta UX/UI Diseinatzailea.",
        "about_me": {
          "title": "Niri buruz",
          "subtitle": "26 urte dauzkat eta orain arte diseinatzaile grafiko modura egin dut lan Vicenzako Bizzart kooperatiba sozialean.",
          "text": "Orain arte, Wordpress erabiliz, web orriak kudeatzeko eta horiek maketatzeko aukera izan dut. Gainera, garapeneko proiektu ezberdinetan, front-end-eko zatia egiten ere egon naiz. <br><br>  Nire helburu nagusiena egun hauetan, teknologia berrietan formatzen jarraitzea da eta horregatik, nire aisialdiaren zati bati, artikuluak, bideoak edo tutorialak ikusten pasatzen dut. <br><br> Nitaz gehiago jakin nahi baduzu, nire <strong>curriculum vitaea</strong> kontsulta dezakezu.",
          "image": {
            "alt": "Kamerari irribarre egiten ari den emakume betaurrekodun baten irudia",
            "title": "Emakume irribarretsu baten irudia"
          }
        },
        "projects": "Proiektuak"
      },
      "itear": {
        "card": {
          "subtitle": "Branding eta UX/UI Diseinua"
        },
        "project": {
          "title": "Itear: Enpresa txiki eta familiarrentzako identitate berria.",
          "subtitle": "Nortasun berri bat sortu, paper korporatiboa eguneratu eta webgune berri baten bidez enpresari balio erantsi bat ezartzea zer proiektuaren helburua.",
          "project_overview": "Proiektuaren <br className='hiddem xl:block'> ikuspegi orokorra",
          "project_overview_text": "Itear, Tolosan (Gipuzkoan) dagoen enpresa txiki bat da, eta 80ko hamarkadatik makina industrialak fabrikatzen eta konpontzen ditu. Bere zerbitzuen artean, ponpa zentrifugoak nabarmentzen dira, hauen funtzioa energia mekanikoa energia hidrauliko bihurtzea delarik. Enpresarentzat, garrantzitsua da piezen kalitateari, funtsari eta funtzionamenduari eustea. Horrez gain, metalurgian zentratutako hainbat hornitzailerekin elkarlanean aritzen den enpresa da, bere lana aurrera eramateko.",
          "challenge": "Erronka",
          "challenge_subtitle": "Proiektuaren helburua eduki sare sendo bat sortzea zen, non entitate industrial bat identifikatuko zen. Edukien sarearen barruan, enpresaren ikusizko identitatea eta webgunea.",
          "challenge_text": "Baliabide horien barruan, sakondu egin zen enpresan jarraitutako lan-prozesuan, eskainitako zerbitzuetan eta erakundearen ezaugarri diren balioetan. Proiektuaren barruan, lana jasangarritasun eta ekonomia zirkularraren balioen barruan egitea hartu zen kontutan.",
          "solution": "Soluzioa",
          "solution_subtitle": "Sinter letra-tipo gisa Demi bertsioan, industria-sektoreko tradizioa eta modernizazioa erakusteko.",
          "solution_text": "Hain zuzen ere, piezen irudien zuzendaritza artistikoari eta nortasun berriari esker sortu zen enpresaren unibertso berria.",
          "next_project": "Hurrengo Proiektua",
          "images": {
            "cover": {"alt": "Itearko pieza baten argazkia fondo txuri batean", "title": "Itearko pieza baten argazkia"},
            "variation_one": {"alt": "Itear-en logo batek izan ditzakeen aldaerak erakusten dituen irudia", "title": "Itear-en logoa erakusten duen irudia"},
            "variation_two": {"alt": "Itearreko brandingaren ikonoetako bat erakusten duen irudia", "title": "Ikono baten irudia"},
            "variation_three": {"alt": "Itear-en pieza baten xehetasuna hondo zuri batean", "title": "Pieza baten xehetasunaren irudia"},
            "variation_four": {"alt": "Esku baten xehetasuna, pieza bat soldatzen eta hobetzen", "title": "Esku bat soldatzen"},
            "variation_five": {"alt": "Iragazki urdina duen hondo zuriko pieza baten irudia", "title": "Itearreko pieza baten irudia"},
            "variation_six": {"alt": "Hondo zuria duen Itear pieza baten irudia", "title": "Itearreko pieza baten irudia"},
            "variation_seven": {"alt": "Itear enpresaren paper korporatiboa erakusten duen irudia", "title": "Itear-en paper korporatiboaren irudia"},
            "variation_eight": {"alt": "Itear enpresaren paper korporatiboaren bisita-txartela erakusten duen irudia", "title": "Itear-en paper korporatiboaren irudia"},
            "variation_nine": {"alt": "Itear enpresaren paper korporatiboaren karpeta korporatiboa erakusten duen irudia", "title": "Itear-en paper korporatiboaren irudia"},
            "variation_ten": {"alt": "Itear-en webgune korporatibo berriaren diseinua aurkezten duen irudia", "title": "Itearren webgunea aurkezten duen irudia"},
            "next_project": {"alt": "Kimuren proiektuari erreferentzia egiten dion irudia", "title": "Kimuren argazkia"}
          }
        }
      },
      "kimu": {
        "card": {
          "subtitle": "Branding, Packaging eta UX/UI Diseinua"
        },
        "project": {
          "title": "Kimu: Nortasun berria <br className='hidden xl:block'> eta packaging-a.",
          "subtitle": "Nortasun korporatibo berria sortzea, ontzi-diseinu berria egitea eta enpresaren balioak webgune baten bidez sustatzea eta bermatzea izan ziren proiektuaren helburuak.",
          "project_overview": "Proiektuaren <br className='hiddem xl:block'> ikuspegi orokorra",
          "project_overview_text": "Bizkaiko herri txiki batean dago Kimu Germinatuak, eta Euskal Herrian germinatuen laborantzan eta merkaturatzean espezializatutako tokiko enpresa bakarra da, eta denda txikietan saltzen ditu bere produktuak. Kimu beste erakunde batzuetatik bereizten da bertako biztanleei produktu ugari eskaintzen dizkielako. Ernamuin freskoak eta kontsumitzeko prest daudenak saltzeaz gain, haziak ere saltzen ditu jendeak bere etxeetan bertan ernamuinak ekoitzi ahal izateko.",
          "challenge": "Erronka",
          "challenge_subtitle": "Proiektuaren helburua zen marka berri bat sortzea eta iraunkortasun eta berrerabilpen printzipioekin bat zetozen ontziak sortzea.",
          "challenge_text": "Horrela, marka definitzen duten terminoak dira, alde batetik, entitate gardena dela, aberasgarria eta eskuragarria dela, eta, bestetik, DIY kontzeptuan zentratzen den marka dela.",
          "solution": "Soluzioa",
          "solution_subtitle": "Bariazio bakar batean oinarritutako marka. Egitura sinple bat jarraitzen du, markaren beraren letren arteko distantziaren bidez sortzen dena.",
          "solution_text": "Identitatea eta ontzia sortzeko, hiru elementuekin –tipografia, alegia– lotura eta koherentzia duen diseinu bat proposatu zen, beti Franklin Gothic erabiliz, tamaina edo hierarkia ezberdinetan; bestetik, koloreak eta ilustrazioa, baserrien baratzeak erreferentziatzat hartuta egin zena.",
          "next_project": "Hurrengo Proiektua",
          "images": {
            "cover": {"alt": "Adineko pertsona bat bikote batekin hizketan, Tolosako merkatuan", "title": "Tolosako azokaren irudia"},
            "variation_one": {"alt": "Kimu zuriaren logotipoa hondo laranjan erakusten duen irudia", "title": "Kimuren logotipoa erakusten duen irudia"},
            "variation_two": {"alt": "Kimu beltzaren isotipoa hondo zurian erakusten duen irudia", "title": "Kimuren isotipoa erakusten duen irudia"},
            "variation_three": {"alt": "Barazki batzuk eusten dituen esku baten xehetasuna erakusten duen irudia", "title": "Esku baten irudia"},
            "variation_four": {"alt": "Hondo laranjan trazadura zuria duen porru baten irudia", "title": "Porru baten irudia"},
            "variation_five": {"alt": "Hondo zurian dauden lerro organiko beltzen irudi baten irudia", "title": "Lerro organikoen irudi baten irudia"},
            "variation_six": {"alt": "Kimuren tote bag korporatibo bati eusten dion esku baten irudia", "title": "Tote bag baten irudia"},
            "variation_seven": {"alt": "Garbantzu ernamuinak saltzeko erabiltzen den ontziko packagingaren aurreko aldea erakusten duen irudia", "title": "Hozituen flaskoaren irudia"},
            "variation_eight": {"alt": "Garbantzu ernamuinak saltzeko erabiltzen den ontziko packagingaren atzealdea erakusten duen irudia", "title": "Hozituen flaskoaren irudia"},
            "variation_nine": {"alt": "Babarrun hozituen haziak ontziratzeko erabiltzen den flaskoko packagingaren aurreko aldea erakusten duen irudia", "title": "Babarrun hozituen flaskoaren irudia"},
            "variation_ten": {"alt": "Hondo laranja korporatibo batean desktop tamainako zenbait orriren diseinua erakusten duen irudia", "title": "Kimuren webguneko orrialde ezberdinak aurkezten dituen irudia"},
            "variation_eleven": {"alt": "Hondo laranja korporatibo batean mobile tamainako zenbait orriren diseinua erakusten duen irudia", "title": "Kimuren webguneko orrialde ezberdinak aurkezten dituen irudia"},
            "next_project": {"alt": "Ezagutu proiektuari erreferentzia egiten dion irudia", "title": "Descubre-ren irudia"}
          }
        }
      },
      "descubre": {
        "card": {
          "subtitle": "Diseinu editoriala"
        },
        "project": {
          "title": "Descubre: Aldizkari bat sortu.",
          "subtitle": "Aldizkari baterako diseinu berri bat sortzea zen proiektuaren funtsa.",
          "project_overview": "Proiektuaren <br className='hiddem xl:block'> ikuspegi orokorra",
          "project_overview_text": "Mundu osoko kulturen tapiz aberatsa arakatzen diharduen hilabetekaria da Descubre. Descubre-ren zenbaki bakoitzak herrialde desberdin bat du ardatz, eta irakurleei haren historia, tradizioak, gaurkotasuna eta ohitura bereziak sakon aztertzeko aukera ematen die.Antzinako zibilizazioak ezagutzera ematetik gaur egungo garapenak argitzera, Deskargak gure komunitate globala eratzen duten bizimodu askotarikoak hezi eta horiekiko jakin-mina piztu nahi du. Artikulu bikain onduekin, argazki txundigarriekin eta istorio erakargarriekin, nazio bakoitzaren bihotzera eta arimara sartzeko leiho gisa balio du, munduko txoko guztietako kulturen ulermena eta estimua sustatuz.",
          "challenge": "Erronka",
          "challenge_subtitle": "Descubre proiektuaren helburua informatzeaz gain irakurleak liluratuko dituen aldizkari bat diseinatzea eta sortzea zen, eduki hausnartuen eta diseinu estetikoki erakargarriaren arteko nahasketa baten bidez.",
          "challenge_text": "Testuak, ilustrazioak eta irudiak maketatzeko, proiektuaren beharren araberako lauki-sare bat diseinatu zen, informazio guztia ondo ahokatu zedin.",
          "solution": "Soluzioa",
          "solution_subtitle": "Diseinu prozesua sareta gida gisa hartuta hasi zen, eta hortik aurrera orriak sortu ziren emaitza egokia lortu arte.",
          "solution_text": "Descubre-ren ale bakoitzak elementu interaktiboak eta bisualki estimulagarriak integratzen ditu, hala nola ilustrazio pertsonalizatuak eta kalitate handiko argazkilaritza, elkarrekin lan egiten dutenak irakurketa-esperientzia hobetzeko. Argitalpen- eta diseinu-egitura kohesionatu bati sendo atxikiz, proiektuaren emaitza aldizkari bat izan zen, ezagutza-iturri gisa ez ezik, kultura globalen edertasuna eta aniztasuna islatzen duen arte-pieza gisa ere balio duena.",
          "view_project": "Azken emaitza ikusteko, aldizkari interaktiboa ikusteko sarbidea",
          "view_project_here": "hemen",
          "next_project": "Hurrengo Proiektua"
        }
      },
      "errofest": {
        "card": {
          "subtitle": "Branding, UX/UI Diseinua eta Garapanea"
        },
        "project": {
          "title": "Errofest: Identitate baten sorrera eta tokiko jaialdi baten promozioa.",
          "subtitle": "Identitatea eta lurreratze orria sortzea izan zen proiektuaren funtsa, jaialdia ahalik eta ondoen sustatzeko.",
          "project_overview": "Proiektuaren <br className='hiddem xl:block'> ikuspegi orokorra",
          "project_overview_text": "Errofest jaialdi kulturala da, eta hainbat jarduera biltzen ditu, besteak beste, bertako gastronomia, musika eta pintura. Itsasondon, Gipuzkoako herri batean, egiten da 2019tik eta urtetik urtera interes handiagoa sortzen du bertakoen eta eskualdeko beste herrietako jendearen artean. <br><br> 2025ean, ekitaldiak bosgarren urteurrena ospatuko du. Hori dela eta, antolatzaileek haien nortasuna eta lurreratze-orria hobetzea erabaki zuten.",
          "challenge": "Erronka",
          "challenge_subtitle": "Proiektuak bi helburu zituen: jaialdiaren espiritu lokala islatuko zuen identitate berri bat sortzea eta jaialdira joateko orduan kontuan hartu beharreko alderdiak laburki azalduko zituen lurreratze orrialde xume bat diseinatzea.",
          "challenge_text": "Ingurua, paisaiaren koloreak eta tokiko kultura izan ziren kontuan jaialdiaren nortasun berria sortzerakoan. Horrez gain, tradizioaren eta joera kultural berrien arteko uztarketa islatzen saiatu ziren.",
          "solution": "Soluzioa",
          "solution_subtitle": "Logotipoa eskuz egin zuten, naturaren beraren marra kurbatuak eta organikoak erakusteko.",
          "solution_text": "Natura gogorarazten duten koloreei esker, jaialdia ospatu zen beste urteetatik bildutako irudiei esker eta lurreratze orrialde berriaren beharrei buruz egindako ariketari esker, orrialde berri bat sortu zen.",
          "view_project": "Azken emaitza ikusteko, sartu web gunera",
          "view_project_here": "hemen",
          "project_web": "https://errofest.vercel.app/eu",
          "next_project": "Hurrengo Proiektua"
        }
      },
      "design_system": {
        "card": {
          "subtitle": "UX/UI Diseinua"
        },
        "project": {
          "title": "Musika-aplikazio bati egokitutako diseinu-sistema bat sortzea.",
          "subtitle": "Echo izeneko musika plataforma berrian erabiliko zen sistema diseinatzea zen proiektuaren helburua.",
          "project_overview": "Proiektuaren <br className='hiddem xl:block'> ikuspegi orokorra",
          "project_overview_text": "Echo aplikazioak erabiltzailearen esperientzia intuitiboa eta erosoa eskaini nahi du, musika erraz entzuteko. Beraz, aplikazioak izango zituen funtzionalitateak zerrendatu ondoren iritsi zen abiapuntura, eta horri esker, printzipioak, funtzioak eta osagaiak hobeto garatu ahal izan ziren.",
          "challenge": "Erronka",
          "challenge_subtitle": "Diseinu sistema osatuko luketen elementuen zerrenda osoaren inguruan hausnartu ondoren, elementu nagusien garapena hasi zuen.",
          "challenge_text": "Garatu ziren lehen elementuak letra motak, koloreak, elementu grafikoak, ikonografia eta egitura izan ziren.",
          "typefaces": "Tipografiak",
          "typefaces_text": "IBM Plex Mono letra-tipoa izenburuetarako erabiltzen da eta Inter letra-tipoa testuetarako. Letra-moten eskalak gailuaren hainbat tamainatan erabiltzeko definitu dira. Tamaina horiek aldatu egiten dira, eta gailuen tamainaren arabera ezarritako ordenari jarraitzen diote.",
          "colours": "Koloreak",
          "colours_text": "Kolore-paleta bost kolore sekundarioekin ezarri da, eta nagusiekin batera (zuria eta beltza), koloreak konbinatzen laguntzen dute, hainbat konposizio sortzeko. Bestetik, kolore semantikoak daude, erabiltzaileari informazioa emateko aukeratu direnak. Konposizio berriak sortzeko gardentasun kromatikoko mota ezberdinak ere erabiliko dira.",
          "iconography": "Ikonografia",
          "iconography_text": "Ikonoen tamainak zutabeen tamainen eta orrialdeen diseinuen logika berari jarraituz ezarri dira.",
          "solution": "Soluzioa",
          "solution_subtitle": "Diseinu-sistemaren printzipioak findu ondoren, osagaiak sortzeko unea iritsi zen.",
          "solution_text": "Hainbat gailu eta pantaila tamainatan erabiliko zirelakoan sortu ziren liburutegiko osagaiak. Gainera, horiek sortzeko diseinu argi eta erraza erabili zen, diseinua gauzatzea eta pantailen kokapena eraginkorragoak izan zitezen.",
          "next_steps": "Hurrengo pausoak",
          "next_steps_text": "Lan prozesu osoa egin ondoren, hurrengo pausoa Echo aplikazioak izango zituen pantailetan pentsatzea izan zen. Honi buruz gehiago jakin nahi baduzu, proiektuaren <a href=https://www.figma.com/design/DviDdC0Vn7GTRyGWuMsVjX/Echo?node-id=0-1&p=f&t=7dHt3xV2X6vmvCCC-0' target='_blank' class='relative after:absolute after:bottom-[10px] after:left-0 after:h-[5px] after:w-full after:origin-bottom-left after:scale-x-100 after:bg-yellow after:transition-transform after:duration-150 after:ease-in-out hover:after:origin-bottom-right hover:after:scale-x-0'>esteka </a> honen bitartez kontsulta dezakezu.",
          "next_project": "Hurrengo Proiektua"
        }
      },
      "echo": {
        "card": {
          "subtitle": "UX/UI Diseinua"
        },
        "project": {
          "title": "Echo: musika streaming bidez entzuteko aplikazio bat.",
          "subtitle": "Proiektuaren ardatza erabiltzailearen esperientzia (UX) eta aplikazioaren erabiltzaile-interfazearen diseinua (UI) izan ziren.",
          "project_overview": "Proiektuaren <br className='hiddem xl:block'> ikuspegi orokorra",
          "project_overview_text": "Echo musika-streaming plataforma bat da, erabiltzaile-esperientzia erraz eta eraginkorra eskaini nahi duena, eta, horretarako, interfaze intuitibo eta erabilerraza du. Hasieratik, aplikazioa lehen erabileratik intuitiboa izateko diseinatu zen. Gainera, iradokitako musikak bat etorri behar zuen erabiltzailearen gustuekin, eta interfazeak gozamen eta erosotasun sentsazioa transmititu behar zuen.",
          "challenge": "Erronka",
          "challenge_subtitle": "Helburuak zehaztu eta sistema diseinatu eta dokumentatu ondoren, orrialdeen diseinua planifikatu zen eta aplikazioaren orrialde guztietarako wireframeak egin ziren.",
          "challenge_text": "Wireframeak maketatzeko, 16 px-ko lauki bati jarraitu zitzaion, aldez aurretik diseinatutako osagai guztiak sortzen eta lotzen laguntzeko. ",
          "solution": "Soluzioa",
          "solution_subtitle": "Txantiloi guztiak sortu ondoren, irudiak eta koloreak gehitzeko unea iritsi zen, plataformaren prototipoa amaitzeko.",
          "solution_text": "Gainera, asko nabarmendu zen app hau musika-streamingeko beste plataforma batzuetatik bereizten duen ezaugarria: aurrez definitutako erreprodukzio-zerrendak soilik eskaini beharrean, erabiltzaile bakoitzaren gustu musikaletara egokituko da galdera praktikoen bidez. Horrela, erreprodukzio-zerrenda pertsonalizatuak eta erabiltzaile bakoitzaren musika-interesetara egokituak sortuko dira.",
          "next_project": "Hurrengo Proiektua"

        }
      },
      "footer": {
        "title": "Ez izan zalantzarik nirekin kontaktuan jartzeko!",
        "social_networks": "Sare sozialak"
      }
    }
  }